# LevelDataVolume Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LevelDataVolume Property
ParameterTypeId Class See Also
---
"Floor Volume"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LevelDataVolume { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelDataVolume As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LevelDataVolume {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace